;;; chokan-roman-table.el --- Hepburn romanization conversion table -*- lexical-binding: t; byte-compile-docstring-max-column: 120; -*-
;; Copyright (C) 2024 derui

;; Author: derui <derutakayu@gmail.com>
;; Maintainer: derui <derutakayu@gmail.com>
;; URL: 
;; Version: 0.1.0
;; Created: 2024
;; Package-Requires: ((emacs "27.1"))
;; Keywords: ime

;;; Commentary:
;;
;;: Customization:

;;; Code:

(defconst chokan--roman-table
  '(
    ("a" . "あ")
    ("i" . "い")
    ("u" . "う")
    ("e" . "え")
    ("o" . "お")
    ("A" . "あ")
    ("I" . "い")
    ("U" . "う")
    ("E" . "え")
    ("O" . "お")
    
    ("ka" . "か")
    ("ki" . "き")
    ("ku" . "く")
    ("ke" . "け")
    ("ko" . "こ")
    ("Ka" . "か")
    ("Ki" . "き")
    ("Ku" . "く")
    ("Ke" . "け")
    ("Ko" . "こ")
    
    ("sa" . "さ")
    ("si" . "し")
    ("shi" . "し")
    ("su" . "す")
    ("se" . "せ")
    ("so" . "そ")
    ("Sa" . "さ")
    ("Si" . "し")
    ("Shi" . "し")
    ("Su" . "す")
    ("Se" . "せ")
    ("So" . "そ")
    
    ("ta" . "た")
    ("ti" . "ち")
    ("chi" . "ち")
    ("tu" . "つ")
    ("tsu" . "つ")
    ("te" . "て")
    ("to" . "と")
    ("Ta" . "た")
    ("Ti" . "ち")
    ("Chi" . "ち")
    ("Tu" . "つ")
    ("Tsu" . "つ")
    ("Te" . "て")
    ("To" . "と")

    ("na" . "な")
    ("ni" . "に")
    ("nu" . "ぬ")
    ("ne" . "ね")
    ("no" . "の")
    ("Na" . "な")
    ("Ni" . "に")
    ("Nu" . "ぬ")
    ("Ne" . "ね")
    ("No" . "の")

    ("ha" . "は")
    ("hi" . "ひ")
    ("hu" . "ふ")
    ("fu" . "ふ")
    ("he" . "へ")
    ("ho" . "ほ")
    ("Ha" . "は")
    ("Hi" . "ひ")
    ("Hu" . "ふ")
    ("Fu" . "ふ")
    ("He" . "へ")
    ("Ho" . "ほ")
    
    ("ma" . "ま")
    ("mi" . "み")
    ("mu" . "む")
    ("me" . "め")
    ("mo" . "も")
    ("Ma" . "ま")
    ("Mi" . "み")
    ("Mu" . "む")
    ("Me" . "め")
    ("Mo" . "も")

    ("ra" . "ら")
    ("ri" . "り")
    ("ru" . "る")
    ("re" . "れ")
    ("ro" . "ろ")
    ("Ra" . "ら")
    ("Ri" . "り")
    ("Ru" . "る")
    ("Re" . "れ")
    ("Ro" . "ろ")

    ("ya" . "や")
    ("yu" . "ゆ")
    ("yo" . "よ")
    ("Ya" . "や")
    ("Yu" . "ゆ")
    ("Yo" . "よ")

    ("wa" . "わ")
    ("wi" . "ゐ")
    ("wo" . "を")
    ("we" . "ゑ")
    ("nn" . "ん")
    ("Wa" . "わ")
    ("Wi" . "ゐ")
    ("Wo" . "を")
    ("We" . "ゑ")
    ("Nn" . "ん")

    ;; 濁音・半濁音
    ("ga" . "が")
    ("gi" . "ぎ")
    ("gu" . "ぐ")
    ("ge" . "げ")
    ("go" . "ご")
    ("Ga" . "が")
    ("Gi" . "ぎ")
    ("Gu" . "ぐ")
    ("Ge" . "げ")
    ("Go" . "ご")

    ("za" . "ざ")
    ("zi" . "じ")
    ("ji" . "じ")
    ("zu" . "ず")
    ("ze" . "ぜ")
    ("zo" . "ぞ")
    ("Za" . "ざ")
    ("Zi" . "じ")
    ("Ji" . "じ")
    ("Zu" . "ず")
    ("Ze" . "ぜ")
    ("Zo" . "ぞ")

    ;; jiが両方に利用するのは、ローマ字変換では区別できないので、「ぢ」については定義しない
    ("da" . "だ")
    ("di" . "ぢ")
    ("du" . "づ")
    ("de" . "で")
    ("do" . "ど")
    ("Da" . "だ")
    ("Di" . "ぢ")
    ("Du" . "づ")
    ("De" . "で")
    ("Do" . "ど")

    ("ba" . "ば")
    ("bi" . "び")
    ("bu" . "ぶ")
    ("be" . "べ")
    ("bo" . "ぼ")
    ("Ba" . "ば")
    ("Bi" . "び")
    ("Bu" . "ぶ")
    ("Be" . "べ")
    ("Bo" . "ぼ")

    ("pa" . "ぱ")
    ("pi" . "ぴ")
    ("pu" . "ぷ")
    ("pe" . "ぺ")
    ("po" . "ぽ")
    ("Pa" . "ぱ")
    ("Pi" . "ぴ")
    ("Pu" . "ぷ")
    ("Pe" . "ぺ")
    ("Po" . "ぽ")

    ;; 拗音
    ("kya" . "きゃ")
    ("kyu" . "きゅ")
    ("kyo" . "きょ")
    ("Kya" . "きゃ")
    ("Kyu" . "きゅ")
    ("Kyo" . "きょ")

    ("sha" . "しゃ")
    ("shu" . "しゅ")
    ("sho" . "しょ")
    ("sya" . "しゃ")
    ("syu" . "しゅ")
    ("syo" . "しょ")
    ("Sha" . "しゃ")
    ("Shu" . "しゅ")
    ("Sho" . "しょ")
    ("Sya" . "しゃ")
    ("Syu" . "しゅ")
    ("Syo" . "しょ")

    ("cha" . "ちゃ")
    ("chu" . "ちゅ")
    ("cho" . "ちょ")
    ("Cha" . "ちゃ")
    ("Chu" . "ちゅ")
    ("Cho" . "ちょ")
    ("tya" . "ちゃ")
    ("tyu" . "ちゅ")
    ("tyo" . "ちょ")
    ("Tya" . "ちゃ")
    ("Tyu" . "ちゅ")
    ("Tyo" . "ちょ")

    ("nya" . "にゃ")
    ("nyu" . "にゅ")
    ("nyo" . "にょ")
    ("Nya" . "にゃ")
    ("Nyu" . "にゅ")
    ("Nyo" . "にょ")

    ("hya" . "ひゃ")
    ("hyu" . "ひゅ")
    ("hyo" . "ひょ")
    ("Hya" . "ひゃ")
    ("Hyu" . "ひゅ")
    ("Hyo" . "ひょ")

    ("mya" . "みゃ")
    ("myu" . "みゅ")
    ("myo" . "みょ")
    ("Mya" . "みゃ")
    ("Myu" . "みゅ")
    ("Myo" . "みょ")

    ("rya" . "りゃ")
    ("ryu" . "りゅ")
    ("ryo" . "りょ")
    ("Rya" . "りゃ")
    ("Ryu" . "りゅ")
    ("Ryo" . "りょ")

    ("gya" . "ぎゃ")
    ("gyu" . "ぎゅ")
    ("gyo" . "ぎょ")
    ("Gya" . "ぎゃ")
    ("Gyu" . "ぎゅ")
    ("Gyo" . "ぎょ")

    ("ja" . "じゃ")
    ("ju" . "じゅ")
    ("jo" . "じょ")
    ("Ja" . "じゃ")
    ("Ju" . "じゅ")
    ("Jo" . "じょ")

    ("bya" . "びゃ")
    ("byu" . "びゅ")
    ("byo" . "びょ")
    ("Bya" . "びゃ")
    ("Byu" . "びゅ")
    ("Byo" . "びょ")

    ("pya" . "ぴゃ")
    ("pyu" . "ぴゅ")
    ("pyo" . "ぴょ")
    ("Pya" . "ぴゃ")
    ("Pyu" . "ぴゅ")
    ("Pyo" . "ぴょ")

    ;; 外来語
    ("fa" . "ふぁ")
    ("fi" . "ふぃ")
    ("fe" . "ふぇ")
    ("fo" . "ふぉ")
    ("Fa" . "ふぁ")
    ("Fi" . "ふぃ")
    ("Fe" . "ふぇ")
    ("Fo" . "ふぉ")

    ;; 小書き
    ("xa" . "ぁ")
    ("xi" . "ぃ")
    ("xu" . "ぅ")
    ("xe" . "ぇ")
    ("xo" . "ぉ")
    
    ("xya" . "ゃ")
    ("xyu" . "ゅ")
    ("xyo" . "ょ")
    ("xtu" . "っ")
    ("xtsu" . "っ")
    ("xwa" . "ゎ")
    )
  "chokanで利用するローマ字変換表。但し、歴史的事情であったり入力負荷が高いような綴りについては、
広く利用されている形式も利用できるようにしている。

先頭が大文字であるものが定義されているのは、下線部の起動時と挙動を一致させるためである。
"
  )

(defvar chokan-table--katakana-table
  '(
    ("あ" . "ア")
    ("い" . "イ")
    ("う" . "ウ")
    ("え" . "エ")
    ("お" . "オ")
    ;; 
    ("か" . "カ")
    ("き" . "キ")
    ("く" . "ク")
    ("け" . "ケ")
    ("こ" . "コ")
    ;; 
    ("さ" . "サ")
    ("し" . "シ")
    ("す" . "ス")
    ("せ" . "セ")
    ("そ" . "ソ")
    ;; 
    ("た" . "タ")
    ("ち" . "チ")
    ("つ" . "ツ")
    ("て" . "テ")
    ("と" . "ト")
    ;; 
    ("な" . "ナ")
    ("に" . "ニ")
    ("ぬ" . "ヌ")
    ("ね" . "ネ")
    ("の" . "ノ")
    ;; 
    ("は" . "ハ")
    ("ひ" . "ヒ")
    ("ふ" . "フ")
    ("へ" . "ヘ")
    ("ほ" . "ホ")
    ;; 
    ("ま" . "マ")
    ("み" . "ミ")
    ("む" . "ム")
    ("め" . "メ")
    ("も" . "モ")
    ;; 
    ("や" . "ヤ")
    ("ゆ" . "ユ")
    ("よ" . "ヨ")
    ;; 
    ("ら" . "ラ")
    ("り" . "リ")
    ("る" . "ル")
    ("れ" . "レ")
    ("ろ" . "ロ")
    ;; 
    ("わ" . "ワ")
    ("を" . "ヲ")
    ("ゐ" . "ヰ")
    ("ゑ" . "ヱ")
    ("を" . "ヲ")
    ("ん" . "ン")
    ;; 
    ("が" . "ガ")
    ("ぎ" . "ギ")
    ("ぐ" . "グ")
    ("げ" . "ゲ")
    ("ご" . "ゴ")
    ;; 
    ("ざ" . "ザ")
    ("じ" . "ジ")
    ("ず" . "ズ")
    ("ぜ" . "ゼ")
    ("ぞ" . "ゾ")
    ;; 
    ("だ" . "ダ")
    ("ぢ" . "ヂ")
    ("づ" . "ヅ")
    ("で" . "デ")
    ("ど" . "ド")
    ;;
    ("ば" . "バ")
    ("び" . "ビ")
    ("ぶ" . "ブ")
    ("べ" . "ベ")
    ("ぼ" . "ボ")
    ;;
    ("ぱ" . "パ")
    ("ぴ" . "ピ")
    ("ぷ" . "プ")
    ("ぺ" . "ペ")
    ("ぽ" . "ポ")
    ;;
    ("ゃ" . "ャ")
    ("ゅ" . "ュ")
    ("ょ" . "ョ")
    ("っ" . "ッ")
    ("ゎ" . "ヮ")
    ("ぁ" . "ァ")
    ("ぃ" . "ィ")
    ("ぅ" . "ゥ")
    ("ぇ" . "ェ")
    ("ぉ" . "ォ")
    )
  "ひらがなからカタカナへの変換テーブル")

(defun chokan-roman-table--sokuon-p (input)
  "inputが促音を含むかどうかを判定する。

ここでの促音は、 'tt' のように子音を重ねたもののみを判定する。
"
  (let ((consonants '(?t ?b ?j ?f ?h ?s ?w ?r ?y ?p ?k ?g ?z ?c ?v)))
    (and (>= (length input) 2)
         (equal (aref input 0) (aref input 1))
         (member (aref input 0) consonants)
         (member (aref input 1) consonants))))

;;;###autoload
(defun chokan-roman-table-roman-to-kana (input) 
  "ローマ字を仮名に変換する。

変換結果によって、以下のいずれかの結果を返す。

- 'nil' : 対応する候補が見つからない場合
- '\"result\"' : 対応する仮名
"
  (let* ((sokuon "")
         (input (downcase input)))
    (while (chokan-roman-table--sokuon-p input)
      (setq sokuon (concat sokuon "っ"))
      (setq input (substring input 1)))
    (pcase (assoc input chokan--roman-table)
      ;; 全体の組み合わせで見つからない場合はnil
      (`() nil)
      ;; 見つかった場合はそのまま返す
      (`(,_ . ,ret)
       (concat sokuon ret)))))

;;;###autoload
(defun chokan-roman-table-hira-to-kata (hira)
  "ひらがなをカタカナに変換する。変換できない文字はそのままで返す"
  (let ((result '()))
    (seq-doseq (c hira)
      (if-let ((kata (assoc (string c) chokan-table--katakana-table)))
          (push (cdr kata) result)
        (push (string c) result)))
    (string-join (seq-reverse result) "")))

(provide 'chokan-roman-table)
